AccumulationRegisters/РасчетыСКлиентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСКлиентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОплате</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оплачивается</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОтгрузке</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отгружается</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетНаОплату</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуКлиенту</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродажаПоЗаказу</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистратора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Comment>Заполняется для реализации товаров и услуг</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключатьПриКонтроле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопустимаяСуммаЗадолженности</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗалогЗаТару</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РасчетныйДокументСКлиентом</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОперации</Name>
					<Comment>Используется в распределении расчетов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокЗачетаПоДатеПлатежа</Name>
					<Comment>Используется в распределении расчетов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвязанныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РасчетныйДокументСКлиентом</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыКонтроляОплатыКлиентом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорОбъектРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорАналитикаУчетаПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаХозяйственнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФинЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаРасходованиеДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРасчетовПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаУчетаПоПартнерамПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПриемник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоДаннымОбъектаРасчетовИсточника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОперацииВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсЧислительВалютыВзаиморасчетов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсВалюты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсЗнаменательВалютыВзаиморасчетов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсВалюты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсЧислительВалютыУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсВалюты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсЗнаменательВалютыУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсВалюты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЗаданияНеоперативногоДопроведенияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗаданияНеоперативногоДопроведенияДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОшибки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполненоСОшибкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПериодЗадания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНеоперативныхЗаданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗаписи</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/КлючиАналитикиУчетаПоПартнерам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КлючиАналитикиУчетаПоПартнерам</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

AccumulationRegisters/РасчетыСКлиентами/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК Т
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Т1 
	|	ПО Т.АналитикаУчетаПоПартнерам = Т1.КлючАналитики
	|;
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Т1.Организация)
	|	И ЗначениеРазрешено(Т1.Партнер)";
	
	Ограничение.ТекстДляВнешнихПользователей =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК ЭтотСписок
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
	|	ПО АналитикаУчетаПоПартнерам.КлючАналитики = ЭтотСписок.АналитикаУчетаПоПартнерам
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВнешниеПользователи КАК ВнешниеПользователиПартнеры
	|	ПО ВнешниеПользователиПартнеры.ОбъектАвторизации = АналитикаУчетаПоПартнерам.Партнер
	|;
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ВнешниеПользователиПартнеры.Ссылка)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// При определении доступных видов оповещений пользователей.
// 
// Параметры:
//  ОписаниеВидовОповещений - см. ОповещенияПользователейОСобытиях.ОписаниеВидовОповещенийПользователей
Процедура ПриОпределенииДоступныхВидовОповещенийПользователей(ОписаниеВидовОповещений) Экспорт
	
	ГруппаВидаОповещенийВзаиморасчеты = ОповещенияПользователейОСобытиях.ГруппаВидаОповещений("ВзаиморасчетыСКлиентами");
	
	НовыйВидОповещений = ОповещенияПользователейОСобытиях.ДобавитьОписаниеВидаОповещенийПользователей(ОписаниеВидовОповещений);
	НовыйВидОповещений.ГруппаВидаОповещений = ГруппаВидаОповещенийВзаиморасчеты;
	НовыйВидОповещений.Идентификатор = "427cb1f4-48be-44a1-9384-874a73f96380";
	НовыйВидОповещений.Наименование = НСтр("ru = 'Поступление оплаты от клиента'", ОбщегоНазначения.КодОсновногоЯзыка());
	НовыйВидОповещений.ТипОповещения = Перечисления.ТипыОповещенийПользователей.Оперативное;
	НовыйВидОповещений.ИмяШаблонаСКД = Метаданные.РегистрыНакопления.РасчетыСКлиентами.Макеты.Оповещения_ПоступлениеОплаты.ПолноеИмя();
	НовыйВидОповещений.ШаблонТекстаОповещения = "ru = 'Поступила оплата на сумму [СуммаПлатежа] [Валюта] [ДатаПлатежа]. [ДокументОплаты]'"; // @NStr-1
	ОповещенияПользователейОСобытиях.ДобавитьОписаниеИсточникаДанных(НовыйВидОповещений,
		Метаданные.РегистрыНакопления.РасчетыСКлиентами.ПолноеИмя());
		
	НовыйВидОповещений = ОповещенияПользователейОСобытиях.ДобавитьОписаниеВидаОповещенийПользователей(ОписаниеВидовОповещений);
	НовыйВидОповещений.ГруппаВидаОповещений = ГруппаВидаОповещенийВзаиморасчеты;
	НовыйВидОповещений.Идентификатор = "f1ebc4d4-2e23-49f3-8fdf-677a69c3cdf6";
	НовыйВидОповещений.Наименование = НСтр("ru = 'Превышение лимита задолженности по договору'", ОбщегоНазначения.КодОсновногоЯзыка());
	НовыйВидОповещений.ТипОповещения = Перечисления.ТипыОповещенийПользователей.Неоперативное;
	НовыйВидОповещений.ИмяШаблонаСКД = Метаданные.РегистрыНакопления.РасчетыСКлиентами.Макеты.Оповещения_ПревышениеЛимитаЗадолженности.ПолноеИмя();
	НовыйВидОповещений.ШаблонТекстаОповещения = "ru = 'Превышен лимит задолженности в [ДопустимаяСуммаЗадолженности] [Валюта] по договору на [СуммаПревышения] [Валюта]'"; // @NStr-1
	НовыйВидОповещений.ТекстСгруппированногоОповещения = "ru = 'Превышен лимит задолженности по договорам.'"; // @NStr-1
	
КонецПроцедуры

#КонецОбласти

#Область НеоперативнаяОчередьЗаданий

// Данные к формированию заданий неоперативного допроведения документов и распределению взаиморасчетов.
// Вызывается при записи набора записей регистра.
// 
// Параметры:
//  НаборЗаписей - РегистрНакопленияНаборЗаписей, РегистрСведенийНаборЗаписей - Записываемый набор записей регистра - источника.
//  ВидыЗаданий - Массив Из СправочникСсылка.ВидыНеоперативныхЗаданий - Список видов заданий.
//                По данному списку должны зарегистрироваться новые задания согласно записываемым данным регистра.
//  МенеджерВременныхТаблиц - Неопределено, МенеджерВременныхТаблиц - При указании МВТ данные временных таблиц будут использованы при формировании новых заданий.
//  ДанныеКРегистрацииЗаданий - Неопределено, ТаблицаЗначений - Таблица с данными к регистрации новых заданий.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Данные к формированию заданий неоперативного допроведения документов:
// * Организация - СправочникСсылка.Организации - Организация, по которой будет сформировано новое задание.
// * ПериодЗадания  - Дата - Период задания. Совпадает с периодом записываемых данных в регистре.
// * Документ - ДокументСсылка - Ссылка на документ, по которому будет зарегистрировано задание.
// * ВидЗадания - СправочникСсылка.ВидыНеоперативныхЗаданий - Вид регистрируемого задания.
//
Функция ДанныеКФормированиюЗаданийНеоперативногоДопроведенияДокументов(НаборЗаписей, ВидыЗаданий,
	МенеджерВременныхТаблиц = Неопределено, ДанныеКРегистрацииЗаданий = Неопределено) Экспорт
	
	ТаблицаДанных = РегистрыСведений.ЗаданияНеоперативногоДопроведенияДокументов.ТаблицаФормированияЗаданий();
	
	Если Не МенеджерВременныхТаблиц = Неопределено Тогда

		Для Каждого ТекущийВидЗадания Из ВидыЗаданий Цикл

			Если ТекущийВидЗадания = Справочники.ВидыНеоперативныхЗаданий.ОтражениеДвиженийПоУправленческомуБалансу Тогда
				
				ТаблицаДанных = РегистрыСведений.ЗаданияНеоперативногоДопроведенияДокументов.ТаблицаФормированияЗаданий();
				
				Если ПланыОбмена.ГлавныйУзел() = Неопределено
					И Не МенеджерВременныхТаблиц = Неопределено 
					И МенеджерВременныхТаблиц.Таблицы.Найти("ОчередьДанныеКДопроведениюДокументовУпрБаланс") <> Неопределено Тогда
					ТаблицаДанных = МенеджерВременныхТаблиц.Таблицы["ОчередьДанныеКДопроведениюДокументовУпрБаланс"].ПолучитьДанные().Выгрузить();
				КонецЕсли;
				
				Возврат ТаблицаДанных;
				
			КонецЕсли;

			Если ТекущийВидЗадания = Справочники.ВидыНеоперативныхЗаданий.РаспределениеВзаиморасчетовПоСрокам Тогда
				ТаблицаДанных = РегистрыСведений.ЗаданияКРаспределениюВзаиморасчетов.ТаблицаФормированияЗаданий();
				Если МенеджерВременныхТаблиц.Таблицы.Найти("ЗаданияКРаспределениюВзаиморасчетовКлиенты") <> Неопределено Тогда
					ИсходныеДанные = МенеджерВременныхТаблиц.Таблицы["ЗаданияКРаспределениюВзаиморасчетовКлиенты"].ПолучитьДанные().Выгрузить();

					Для Каждого Запись Из ИсходныеДанные Цикл
						НоваяСтрока = ТаблицаДанных.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);
						НоваяСтрока.ДатаЗаписи = ТекущаяДатаСеанса();
						НоваяСтрока.ПериодКонтроляИзменений = Запись.ПериодКонтроляИзмененийИСозданияЗаданий;
					КонецЦикла;

				КонецЕсли;
				
				Возврат ТаблицаДанных;
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;

	Возврат ТаблицаДанных;
	
КонецФункции

// Формирует текст запроса получения данных для регистрации заданий в регистре очереди "Задания к распределению взаиморасчетов".
// Задания в регистре очереди будут формироваться по данным таблицы изменений движений, а также по движениям документов данного регистра расчетов, 
// расположенных в цепочке после изменяемых по тем же гранулам распределения взаиморасчетов (АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта).
// 
// Возвращаемое значение:
//  Строка - Текст запроса
Функция ТекстЗапросаДанныеКРегистрацииЗаданийРаспределенияВзаиморасчетов() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	МИНИМУМ(НАЧАЛОПЕРИОДА(ВЫБОР КОГДА РасчетыСКлиентамиИзменения.Сумма = 0
	|								И (РасчетыСКлиентамиИзменения.КОплате <> 0 ИЛИ РасчетыСКлиентамиИзменения.КОтгрузке <> 0)
	|								И ТИПЗНАЧЕНИЯ(РасчетыСКлиентамиИзменения.Документ) <> ТИП(Документ.ВводОстатков)
	|								И ТИПЗНАЧЕНИЯ(РасчетыСКлиентамиИзменения.Документ) <> ТИП(Документ.ВводОстатковВзаиморасчетов)
	|							ТОГДА РасчетыСКлиентамиИзменения.ДатаРегистратора
	|							ИНАЧЕ РасчетыСКлиентамиИзменения.Период
	|						КОНЕЦ, ДЕНЬ)) КАК Период,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА &НеПроверятьДатуЗапретаИНеСоздаватьДочерниеЗадания
	|				ТОГДА ДАТАВРЕМЯ(3999, 1, 1)
	|			ИНАЧЕ НАЧАЛОПЕРИОДА(РасчетыСКлиентамиИзменения.Период, ДЕНЬ)
	|		КОНЕЦ) КАК ПериодКонтроляИзмененийИСозданияЗаданий,
	|	РасчетыСКлиентамиИзменения.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентамиИзменения.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыСКлиентамиИзменения.Валюта КАК Валюта
	|ПОМЕСТИТЬ МинимальныеПериодыИзмененийКлиенты
	|ИЗ
	|	РасчетыСКлиентамиИзменения КАК РасчетыСКлиентамиИзменения
	|ГДЕ
	|	(РасчетыСКлиентамиИзменения.Сумма <> 0
	|	ИЛИ РасчетыСКлиентамиИзменения.КОплате <> 0
	|	ИЛИ РасчетыСКлиентамиИзменения.КОтгрузке <> 0
	|	ИЛИ РасчетыСКлиентамиИзменения.СуммаРегл <> 0
	|	ИЛИ РасчетыСКлиентамиИзменения.СуммаУпр <> 0)
	|	И &НовыеРасчеты
	|	И &СоздаватьЗаданияКРаспределениюВзаиморасчетов
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСКлиентамиИзменения.АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентамиИзменения.ОбъектРасчетов,
	|	РасчетыСКлиентамиИзменения.Валюта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	ОбъектРасчетов,
	|	Валюта,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ЗаданияКРаспределению.ПериодЗадания) КАК ПериодЗадания,
	|	МИНИМУМ(ЗаданияКРаспределению.ПериодКонтроляИзмененийИСозданияЗаданий) КАК ПериодКонтроляИзмененийИСозданияЗаданий,
	|	ЗаданияКРаспределению.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ЗаданияКРаспределению.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ЗаданияКРаспределению.Валюта КАК Валюта,
	|	ЗаданияКРаспределению.Документ КАК Документ,
	|	ЗаданияКРаспределению.Организация КАК Организация
	|ПОМЕСТИТЬ ЗаданияКРаспределениюВзаиморасчетовКлиенты
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР КОГДА РасчетыСКлиентами.Сумма = 0
	|				И (РасчетыСКлиентами.КОплате <> 0 ИЛИ РасчетыСКлиентами.КОтгрузке <> 0)
	|				И ТИПЗНАЧЕНИЯ(РасчетыСКлиентами.Регистратор) <> ТИП(Документ.ВводОстатков)
	|				И ТИПЗНАЧЕНИЯ(РасчетыСКлиентами.Регистратор) <> ТИП(Документ.ВводОстатковВзаиморасчетов)
	|			ТОГДА РасчетыСКлиентами.ДатаРегистратора
	|			ИНАЧЕ РасчетыСКлиентами.Период
	|		КОНЕЦ КАК ПериодЗадания,
	|		МинимальныеПериодыИзмененийКлиенты.ПериодКонтроляИзмененийИСозданияЗаданий КАК ПериодКонтроляИзмененийИСозданияЗаданий,
	|		РасчетыСКлиентами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		РасчетыСКлиентами.ОбъектРасчетов КАК ОбъектРасчетов,
	|		РасчетыСКлиентами.Валюта КАК Валюта,
	|		РасчетыСКлиентами.Регистратор КАК Документ,
	|		РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Организация КАК Организация
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ МинимальныеПериодыИзмененийКлиенты КАК МинимальныеПериодыИзмененийКлиенты
	|			ПО РасчетыСКлиентами.АналитикаУчетаПоПартнерам = МинимальныеПериодыИзмененийКлиенты.АналитикаУчетаПоПартнерам
	|			И РасчетыСКлиентами.ОбъектРасчетов = МинимальныеПериодыИзмененийКлиенты.ОбъектРасчетов
	|			И РасчетыСКлиентами.Валюта = МинимальныеПериодыИзмененийКлиенты.Валюта
	|			И ВЫБОР КОГДА РасчетыСКлиентами.Сумма = 0
	|				И (РасчетыСКлиентами.КОплате <> 0 ИЛИ РасчетыСКлиентами.КОтгрузке <> 0)
	|				И ТИПЗНАЧЕНИЯ(РасчетыСКлиентами.Регистратор) <> ТИП(Документ.ВводОстатков)
	|				И ТИПЗНАЧЕНИЯ(РасчетыСКлиентами.Регистратор) <> ТИП(Документ.ВводОстатковВзаиморасчетов)
	|			ТОГДА РасчетыСКлиентами.ДатаРегистратора
	|			ИНАЧЕ РасчетыСКлиентами.Период
	|			КОНЕЦ >= МинимальныеПериодыИзмененийКлиенты.Период
	|	ГДЕ
	|		РасчетыСКлиентами.Активность
	|		И &НовыеРасчеты
	|		И &СоздаватьЗаданияКРаспределениюВзаиморасчетов
	|		И (РасчетыСКлиентами.Сумма <> 0
	|		ИЛИ РасчетыСКлиентами.КОплате <> 0
	|		ИЛИ РасчетыСКлиентами.КОтгрузке <> 0
	|		ИЛИ РасчетыСКлиентами.СуммаРегл <> 0
	|		ИЛИ РасчетыСКлиентами.СуммаУпр <> 0)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ВЫБОР КОГДА РасчетыСКлиентамиИзменения.Сумма = 0
	|				И (РасчетыСКлиентамиИзменения.КОплате <> 0 ИЛИ РасчетыСКлиентамиИзменения.КОтгрузке <> 0)
	|				И ТИПЗНАЧЕНИЯ(РасчетыСКлиентамиИзменения.Документ) <> ТИП(Документ.ВводОстатков)
	|				И ТИПЗНАЧЕНИЯ(РасчетыСКлиентамиИзменения.Документ) <> ТИП(Документ.ВводОстатковВзаиморасчетов)
	|			ТОГДА РасчетыСКлиентамиИзменения.ДатаРегистратора
	|			ИНАЧЕ РасчетыСКлиентамиИзменения.Период
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА &НеПроверятьДатуЗапретаИНеСоздаватьДочерниеЗадания
	|				ТОГДА ДАТАВРЕМЯ(3999, 1, 1)
	|			ИНАЧЕ НАЧАЛОПЕРИОДА(РасчетыСКлиентамиИзменения.Период, ДЕНЬ)
	|		КОНЕЦ,
	|		РасчетыСКлиентамиИзменения.АналитикаУчетаПоПартнерам,
	|		РасчетыСКлиентамиИзменения.ОбъектРасчетов,
	|		РасчетыСКлиентамиИзменения.Валюта,
	|		РасчетыСКлиентамиИзменения.Документ,
	|		РасчетыСКлиентамиИзменения.Организация
	|	ИЗ
	|		РасчетыСКлиентамиИзменения КАК РасчетыСКлиентамиИзменения
	|	ГДЕ
	|		(РасчетыСКлиентамиИзменения.Сумма <> 0
	|		ИЛИ РасчетыСКлиентамиИзменения.КОплате <> 0
	|		ИЛИ РасчетыСКлиентамиИзменения.КОтгрузке <> 0
	|		ИЛИ РасчетыСКлиентамиИзменения.СуммаРегл <> 0
	|		ИЛИ РасчетыСКлиентамиИзменения.СуммаУпр <> 0)
	|		И &НовыеРасчеты
	|		И &СоздаватьЗаданияКРаспределениюВзаиморасчетов) КАК ЗаданияКРаспределению
	|СГРУППИРОВАТЬ ПО
	|	ЗаданияКРаспределению.АналитикаУчетаПоПартнерам,
	|	ЗаданияКРаспределению.ОбъектРасчетов,
	|	ЗаданияКРаспределению.Валюта,
	|	ЗаданияКРаспределению.Документ,
	|	ЗаданияКРаспределению.Организация";

	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// Исправляет порядок операции в пределах документа набора записей.
// 
// Параметры:
//  НаборЗаписей - РегистрНакопленияНаборЗаписей.РасчетыСКлиентами, РегистрНакопленияНаборЗаписей.РасчетыСПоставщиками - Набор для исправления
//  НомерДокумента - Строка - Номер обновляемого регистратора
Процедура ИсправитьПорядокОперацииВПределахДокумента(НаборЗаписей, НомерДокумента) Экспорт
	
	Для Каждого Запись Из НаборЗаписей Цикл
		
		ПорядокОперацииБезПорядкаВнутриДокумента = ПолучитьПорядокОперацииБезПорядкаВнутриДокумента(Запись.ПорядокОперации, НомерДокумента);
		Если Не ЗначениеЗаполнено(ПорядокОперацииБезПорядкаВнутриДокумента)
			Или Не ЗначениеЗаполнено(Запись.ПорядокОперации) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Запись.Сторно Тогда 
			// Записи сторно должны всегда быть раньше остальных записей, их порядок между собой не важен
			Если Запись.ПорядокОперации <> ПорядокОперацииБезПорядкаВнутриДокумента Тогда
				Запись.ПорядокОперации = ПорядокОперацииБезПорядкаВнутриДокумента;
			КонецЕсли;
		ИначеЕсли СтрДлина(Запись.ПорядокОперации) - СтрДлина(ПорядокОперацииБезПорядкаВнутриДокумента) > 1 Тогда 
			// Если обработчик ошибочно добавил порядок операции в пределах документа 2 или 3 у новых документов 
			// с уже заполненным порядком операции в пределах документа
			Запись.ПорядокОперации = ПорядокОперацииБезПорядкаВнутриДокумента + Сред(Запись.ПорядокОперации, СтрДлина(ПорядокОперацииБезПорядкаВнутриДокумента) + 1, 1);
		ИначеЕсли Запись.ОперацияВзаиморасчетов = Перечисления.ОперацииВзаиморасчетов.Отгрузка
			И Запись.ПорядокОперации <> ПорядокОперацииБезПорядкаВнутриДокумента + "4" Тогда
			// Отгрузки с порядком операции внутри документа 1
			Запись.ПорядокОперации = ПорядокОперацииБезПорядкаВнутриДокумента + "4";
		ИначеЕсли Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереносЗадолженностиМеждуФилиалами
			И ТипЗнч(Запись.Регистратор) <> Тип("ДокументСсылка.ВозвратТоваровОтКлиента")
			И ТипЗнч(Запись.Регистратор) <> Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента")
			И ТипЗнч(Запись.Регистратор) <> Тип("ДокументСсылка.ВозвратТоваровМеждуОрганизациями")
			И ТипЗнч(Запись.Регистратор) <> Тип("ДокументСсылка.ВыкупПринятыхНаХранениеТоваров")
			И ТипЗнч(Запись.Регистратор) <> Тип("ДокументСсылка.ВозвратТоваровПоставщику")
			
			И ТипЗнч(Запись.Регистратор) <> Тип("ДокументСсылка.ОперацияСЭлектроннымБилетом")
			И Запись.ПорядокОперации <> ПорядокОперацииБезПорядкаВнутриДокумента + "5" Тогда
			// ПереносЗадолженностиМеждуФилиалами с порядком операции внутри документа 2
			Запись.ПорядокОперации = ПорядокОперацииБезПорядкаВнутриДокумента + "5";
		ИначеЕсли Запись.ПорядокОперации = ПорядокОперацииБезПорядкаВнутриДокумента Тогда
			// Корректно заполняем порядок операции в пределах документа 2 или 3 для источников, приемников
			Если ЗначениеЗаполнено(Запись.АналитикаУчетаПоПартнерамПриемник) Тогда
				Запись.ПорядокОперации = ПорядокОперацииБезПорядкаВнутриДокумента + "2";
			ИначеЕсли ЗначениеЗаполнено(Запись.КорАналитикаУчетаПоПартнерам) Тогда
				Запись.ПорядокОперации = ПорядокОперацииБезПорядкаВнутриДокумента + "3";
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Обрезает символы порядка операции после номера длокумента
// 
// Параметры:
//  ПорядокОперации - Строка - Исходный порядок операции
//  НомерДокумента - Строка - Номер документа, который ищется в порядке операции
// 
// Возвращаемое значение:
//  Строка - Порядок операции без порядка внутри документа
Функция ПолучитьПорядокОперацииБезПорядкаВнутриДокумента(ПорядокОперации, НомерДокумента) Экспорт
	
	ПозицияНомера = СтрНайти(ПорядокОперации, НомерДокумента, НаправлениеПоиска.СКонца);
	Если ПозицияНомера > 0 Тогда
		Возврат Лев(ПорядокОперации, ПозицияНомера - 1 + СтрДлина(НомерДокумента));
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область КонтрольИтогов

// Есть изменения итогов набора.
// 
// Параметры:
//  Набор - РегистрНакопленияНаборЗаписей.РасчетыСКлиентами,
//          РегистрНакопленияНаборЗаписей.РасчетыСПоставщиками,
//          РегистрНакопленияНаборЗаписей.РасчетыСПоставщикамиПоСрокам,
//          РегистрНакопленияНаборЗаписей.РасчетыСКлиентамиПоСрокам.
// 
// Возвращаемое значение:
//  Булево - Есть изменения итогов набора
Функция ЕстьИзмененияИтоговНабора(Набор) Экспорт
	
	Если НЕ Набор.Модифицированность() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЭтоРасчетыСКлиентами = 
		ТипЗнч(Набор) = Тип("РегистрНакопленияНаборЗаписей.РасчетыСКлиентами")
		ИЛИ ТипЗнч(Набор) = Тип("РегистрНакопленияНаборЗаписей.РасчетыСКлиентамиПоСрокам");
		
	Если ТипЗнч(Набор) = Тип("РегистрНакопленияНаборЗаписей.РасчетыСКлиентами")
		ИЛИ ТипЗнч(Набор) = Тип("РегистрНакопленияНаборЗаписей.РасчетыСПоставщиками") Тогда
		ТекстЗапроса = ТекстЗапросаРасчеты(ЭтоРасчетыСКлиентами);
		
	ИначеЕсли ТипЗнч(Набор) = Тип("РегистрНакопленияНаборЗаписей.РасчетыСКлиентамиПоСрокам")
		ИЛИ ТипЗнч(Набор) = Тип("РегистрНакопленияНаборЗаписей.РасчетыСПоставщикамиПоСрокам") Тогда
		ТекстЗапроса = ТекстЗапросаРасчетыПоСрокам(ЭтоРасчетыСКлиентами);
		
	Иначе
		ТекстОшибки = НСтр("ru = 'Не удалось определить таблицу для сравнения итогов набора записей.'");
		ВызватьИсключение(ТекстОшибки, КатегорияОшибки.ОшибкаКонфигурации);
	КонецЕсли;
	ОбновляемыйРегистратор = Набор.Отбор.Регистратор.Значение;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Регистратор", ОбновляемыйРегистратор);
	Запрос.УстановитьПараметр("НовыеДвижения", Набор.Выгрузить());
	РезультатСравнения = Запрос.Выполнить().Выгрузить();
	
	ЕстьИзменения = РезультатСравнения.Количество() > 0;
	Если ЕстьИзменения Тогда
		РезультатСравнения.Свернуть("Регистратор");
		Для Каждого Запись Из РезультатСравнения Цикл
			СтрокиТекста = Новый Массив;
			СтрокиТекста.Добавить(НСтр("ru = 'После обновления изменились итоги ресурсов в движениях документа. Обновление документа отменено.'"));
			СтрокиТекста.Добавить(ТекстПерепроведитеДокументВРучную());
			ТекстРекомендации = СтрСоединить(СтрокиТекста, Символы.ПС);
			ОбновлениеИнформационнойБазы.ЗарегистрироватьПроблемуСДанными(
				Запись.Регистратор,
				ТекстРекомендации);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ЕстьИзменения;
	
КонецФункции

Функция ТекстЗапросаРасчеты(ЭтоРасчетыСКлиентами)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Расчеты.ВидДвижения КАК ВидДвижения,
	|	Расчеты.Регистратор КАК Регистратор,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Расчеты.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Расчеты.Валюта КАК Валюта,
	|	Расчеты.Сумма КАК Сумма
	|ПОМЕСТИТЬ втНовыеДвижения
	|ИЗ
	|	&НовыеДвижения КАК Расчеты
	|;
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Регистратор КАК Регистратор,
	|	ВложенныйЗапрос.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ВложенныйЗапрос.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ВложенныйЗапрос.Валюта КАК Валюта,
	|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		Расчеты.Регистратор КАК Регистратор,
	|		Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Расчеты.ОбъектРасчетов КАК ОбъектРасчетов,
	|		Расчеты.Валюта КАК Валюта,
	|		-ВЫБОР КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА -Расчеты.Сумма
	|			ИНАЧЕ Расчеты.Сумма
	|		КОНЕЦ КАК Сумма
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|ГДЕ
	|	Расчеты.Регистратор = &Регистратор
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		НовыеДвижения.Регистратор КАК Регистратор,
	|		НовыеДвижения.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		НовыеДвижения.ОбъектРасчетов КАК ОбъектРасчетов,
	|		НовыеДвижения.Валюта КАК Валюта,
	|		ВЫБОР КОГДА НовыеДвижения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА -НовыеДвижения.Сумма
	|			ИНАЧЕ НовыеДвижения.Сумма
	|		КОНЕЦ КАК Сумма
	|	ИЗ
	|		втНовыеДвижения КАК НовыеДвижения
	|	) КАК ВложенныйЗапрос
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Регистратор,
	|	ВложенныйЗапрос.АналитикаУчетаПоПартнерам,
	|	ВложенныйЗапрос.ОбъектРасчетов,
	|	ВложенныйЗапрос.Валюта
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВложенныйЗапрос.Сумма) <> 0
	|";
	
	Если НЕ ЭтоРасчетыСКлиентами Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"РегистрНакопления.РасчетыСКлиентами",
			"РегистрНакопления.РасчетыСПоставщиками"
		);
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаРасчетыПоСрокам(ЭтоРасчетыСКлиентами)

	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Расчеты.ВидДвижения КАК ВидДвижения,
	|	Расчеты.ДокументРегистратор КАК ДокументРегистратор,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Расчеты.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Расчеты.Валюта КАК Валюта,
	|	Расчеты.Предоплата КАК Предоплата,
	|	Расчеты.Долг КАК Долг
	|ПОМЕСТИТЬ втНовыеДвижения
	|ИЗ
	|	&НовыеДвижения КАК Расчеты
	|;
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Регистратор КАК Регистратор,
	|	ВложенныйЗапрос.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ВложенныйЗапрос.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ВложенныйЗапрос.Валюта КАК Валюта,
	|	СУММА(ВложенныйЗапрос.Предоплата) КАК Предоплата,
	|	СУММА(ВложенныйЗапрос.Долг) КАК Долг
	|ИЗ
	|	(ВЫБРАТЬ
	|		Расчеты.ДокументРегистратор КАК Регистратор,
	|		Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Расчеты.ОбъектРасчетов КАК ОбъектРасчетов,
	|		Расчеты.Валюта КАК Валюта,
	|		-ВЫБОР КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА -Расчеты.Предоплата
	|			ИНАЧЕ Расчеты.Предоплата
	|		КОНЕЦ КАК Предоплата,
	|		-ВЫБОР КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА -Расчеты.Долг
	|			ИНАЧЕ Расчеты.Долг
	|		КОНЕЦ КАК Долг
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК Расчеты
	|ГДЕ
	|	Расчеты.Регистратор = &Регистратор
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		НовыеДвижения.ДокументРегистратор КАК Регистратор,
	|		НовыеДвижения.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		НовыеДвижения.ОбъектРасчетов КАК ОбъектРасчетов,
	|		НовыеДвижения.Валюта КАК Валюта,
	|		ВЫБОР КОГДА НовыеДвижения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА -НовыеДвижения.Предоплата
	|			ИНАЧЕ НовыеДвижения.Предоплата
	|		КОНЕЦ КАК Предоплата,
	|		ВЫБОР КОГДА НовыеДвижения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА -НовыеДвижения.Долг
	|			ИНАЧЕ НовыеДвижения.Долг
	|		КОНЕЦ КАК Долг
	|	ИЗ
	|		втНовыеДвижения КАК НовыеДвижения
	|	) КАК ВложенныйЗапрос
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Регистратор,
	|	ВложенныйЗапрос.АналитикаУчетаПоПартнерам,
	|	ВложенныйЗапрос.ОбъектРасчетов,
	|	ВложенныйЗапрос.Валюта
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВложенныйЗапрос.Предоплата) <> 0
	|	ИЛИ СУММА(ВложенныйЗапрос.Долг) <> 0
	|";
	
	Если НЕ ЭтоРасчетыСКлиентами Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"РегистрНакопления.РасчетыСКлиентамиПоСрокам",
			"РегистрНакопления.РасчетыСПоставщикамиПоСрокам"
		);
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Возвращаемое значение:
//  Строка - Текст рекомендации для документа в случае не удачного обновления регистра
//
Функция ТекстПерепроведитеДокументВРучную() Экспорт
	
	Возврат НСтр("ru = 'Перепроведите документ вручную.'");
	
КонецФункции

// Параметры:
//  ИнформацияОбОшибке - ИнформацияОбОшибке
//  ОбновляемыйРегистратор - ДокументСсылка - Обновляемый регистратор
// 
// Возвращаемое значение:
//  Строка - Текст сообщения об ошибке
Функция ТекстСообщенияОбОшибке(ИнформацияОбОшибке, ОбновляемыйРегистратор) Экспорт
	
	ТекстСообщения = НСтр("ru = 'Не удалось обновить документ: %Объект% по причине: %Причина%'");
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Объект%", ОбновляемыйРегистратор);
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
	
	Возврат ТекстСообщения;
	
Конецфункции

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
// Параметры:
// 	Обработчики - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "РегистрыНакопления.РасчетыСКлиентами.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "11.5.27.21";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("489f7d26-6bd5-7943-a55c-3d06d445974a");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыНакопления.РасчетыСКлиентами.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Порядок = Перечисления.ПорядокОбработчиковОбновления.Критичный;
	Обработчик.Комментарий = СтрШаблон(НСтр("ru = 'Исправляет реквизит ""%1"" для движений расчетов.
	                                              |Исправляет реквизит ""%2"" для движений платежей без даты погашения.
	                                              |Исправляет реквизит ""%3"" для движений документов ""%4"". 
												  |Заполняет реквизиты курсов валют взаиморасчетов и упр. учета.'"), 
		Метаданные.РегистрыНакопления.РасчетыСКлиентами.Реквизиты.ПорядокОперации.Представление(),
		Метаданные.РегистрыНакопления.РасчетыСКлиентами.Реквизиты.ПорядокЗачетаПоДатеПлатежа.Представление(),
		Метаданные.РегистрыНакопления.РасчетыСКлиентами.Реквизиты.ДатаРегистратора.Представление(),
		Метаданные.Документы.АктПремииКлиенту.Представление());
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.РегистрыНакопления.РасчетыСКлиентами.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.РегистрыНакопления.РасчетыСКлиентами.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Обработчик.БлокируемыеОбъекты = "";
	
КонецПроцедуры

// Процедура регистрации данных для обработчика обновления ОбработатьДанныеДляПереходаНаВерсию.
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра  = "РегистрНакопления.РасчетыСКлиентами";

	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаРегистров = ПолноеИмяРегистра;
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Период УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Период УБЫВ");
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиРегистраторыРегистра();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	#Область ТекстЗапроса
	Запрос.Текст = "
	|// ИсправлениеПорядковОперацииПлатежейБезДатыПогашения
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВтКОбработке
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|ГДЕ
	|	Расчеты.ДатаПлатежа = ДАТАВРЕМЯ(1,1,1)
	|	И Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Расчеты.Сумма > 0
	|	И ВЫРАЗИТЬ(ЛЕВ(Расчеты.ПорядокЗачетаПоДатеПлатежа, 4) КАК Строка(4))<> ""3000""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// ИсправлениеПорядковОперацииВводаОстатковАвансов
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|ГДЕ
	|	(Расчеты.Регистратор ССЫЛКА Документ.ВводОстатковВзаиморасчетов
	|		ИЛИ Расчеты.Регистратор ССЫЛКА Документ.ВводОстатков)
	|	И Расчеты.Период <> Расчеты.ДатаРегистратора
	|	И Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Расчеты.ДатаРегистратора >= ДАТАВРЕМЯ(2010,1,1)
	|	И (СТРОКА(ГОД(Расчеты.Период) - 2000) <> ПОДСТРОКА(Расчеты.ПорядокОперации, 3, 2)
	|		ИЛИ ВЫБОР КОГДА МЕСЯЦ(Расчеты.Период) > 9
	|				ТОГДА СТРОКА(МЕСЯЦ(Расчеты.Период)) <> ПОДСТРОКА(Расчеты.ПорядокОперации, 5, 2)
	|				ИНАЧЕ СТРОКА(МЕСЯЦ(Расчеты.Период)) <> ПОДСТРОКА(Расчеты.ПорядокОперации, 6, 1)
	|					ИЛИ ПОДСТРОКА(Расчеты.ПорядокОперации, 5, 1) <> ""0""
	|			КОНЕЦ
	|		ИЛИ ВЫБОР КОГДА ДЕНЬ(Расчеты.Период) > 9
	|				ТОГДА СТРОКА(ДЕНЬ(Расчеты.Период)) <> ПОДСТРОКА(Расчеты.ПорядокОперации, 7, 2)
	|				ИНАЧЕ СТРОКА(ДЕНЬ(Расчеты.Период)) <> ПОДСТРОКА(Расчеты.ПорядокОперации, 8, 1)
	|					ИЛИ ПОДСТРОКА(Расчеты.ПорядокОперации, 7, 1) <> ""0""
	|			КОНЕЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// ИсправлениеДатыРегистратораАктовПремииКлиенту
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|ГДЕ
	|	Расчеты.Регистратор ССЫЛКА Документ.АктПремииКлиенту
	|	И Расчеты.Период <> Расчеты.ДатаРегистратора
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// ИсправлениеПорядковОперацииСторно
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|ГДЕ
	|	Расчеты.Сторно
	|	И ПОДСТРОКА(Расчеты.ПорядокОперации, 9, 1) = ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|ГДЕ
	|	Расчеты.Сторно
	|	И ПОДСТРОКА(Расчеты.ПорядокОперации, 9, 1) = ""9""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыСКлиентами.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|			ПО КлючиАналитикиУчетаПоПартнерам.Организация = Организации.Ссылка
	|		ПО РасчетыСКлиентами.АналитикаУчетаПоПартнерам = КлючиАналитикиУчетаПоПартнерам.Ссылка
	|ГДЕ
	|	РасчетыСКлиентами.Сумма <> 0
	|	И РасчетыСКлиентами.СуммаРегл <> 0
	|	И РасчетыСКлиентами.Валюта <> Организации.ВалютаРегламентированногоУчета
	|	И РасчетыСКлиентами.ВалютаДокумента <> Организации.ВалютаРегламентированногоУчета
	|	И РасчетыСКлиентами.КурсЧислительВалютыВзаиморасчетов = 0
	|	И РасчетыСКлиентами.КурсЗнаменательВалютыВзаиморасчетов = 0
	|	И НЕ РасчетыСКлиентами.ХозяйственнаяОперация В (&ОперацииСРучнымКурсом)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыСКлиентами.Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ВалютаУправленческогоУчета КАК ВалютаУправленческогоУчета
	|		ПО РасчетыСКлиентами.Валюта <> ВалютаУправленческогоУчета.Значение
	|			И РасчетыСКлиентами.ВалютаДокумента <> ВалютаУправленческогоУчета.Значение
	|ГДЕ
	|	РасчетыСКлиентами.Сумма <> 0
	|	И РасчетыСКлиентами.СуммаУпр <> 0
	|	И РасчетыСКлиентами.КурсЧислительВалютыУпр = 0
	|	И РасчетыСКлиентами.КурсЗнаменательВалютыУпр = 0
	|	И НЕ РасчетыСКлиентами.ХозяйственнаяОперация В (&ОперацииСРучнымКурсом)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыСКлиентами.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|			ПО КлючиАналитикиУчетаПоПартнерам.Организация = Организации.Ссылка
	|		ПО РасчетыСКлиентами.АналитикаУчетаПоПартнерам = КлючиАналитикиУчетаПоПартнерам.Ссылка
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(РасчетыСКлиентами.Регистратор) В (ТИП(Документ.ВводОстатков), ТИП(Документ.ВводОстатковВзаиморасчетов))
	|	И РасчетыСКлиентами.Сумма <> 0
	|	И РасчетыСКлиентами.СуммаРегл <> 0
	|	И РасчетыСКлиентами.Валюта <> Организации.ВалютаРегламентированногоУчета
	|	И РасчетыСКлиентами.КурсЧислительВалютыВзаиморасчетов = 0
	|	И РасчетыСКлиентами.КурсЗнаменательВалютыВзаиморасчетов = 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыСКлиентами.Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ВалютаУправленческогоУчета КАК ВалютаУправленческогоУчета
	|		ПО РасчетыСКлиентами.Валюта <> ВалютаУправленческогоУчета.Значение
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(РасчетыСКлиентами.Регистратор) В (ТИП(Документ.ВводОстатков), ТИП(Документ.ВводОстатковВзаиморасчетов))
	|	И РасчетыСКлиентами.Сумма <> 0
	|	И РасчетыСКлиентами.СуммаУпр <> 0
	|	И РасчетыСКлиентами.КурсЧислительВалютыУпр = 0
	|	И РасчетыСКлиентами.КурсЗнаменательВалютыУпр = 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// ОчисткаПриемниковИсточниковУСторно
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|ГДЕ
	|	Расчеты.Сторно
	|	И Расчеты.АналитикаУчетаПоПартнерамПриемник <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|ГДЕ
	|	Расчеты.Сторно
	|	И Расчеты.КорАналитикаУчетаПоПартнерам <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО 
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// ИсправлениеПорядковОперацииПереносаРасчетов
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор,
	|	Реестр.НомерДокументаИБ КАК НомерДокумента
	|ПОМЕСТИТЬ ВтКПолучениюНомеров
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
	|		ПО Расчеты.Регистратор = Реестр.Ссылка
	|			И НЕ Реестр.ДополнительнаяЗапись
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтКОбработке КАК ВтКОбработке
	|		ПО Расчеты.Регистратор = ВтКОбработке.Регистратор
	|			И ВтКОбработке.Регистратор ЕСТЬ NULL
	|ГДЕ
	|	НЕ Расчеты.Сторно
	|	И Расчеты.АналитикаУчетаПоПартнерамПриемник <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// ИсправлениеПорядковОперацииСторно
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор,
	|	Реестр.НомерДокументаИБ КАК НомерДокумента
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
	|		ПО Расчеты.Регистратор = Реестр.Ссылка
	|			И НЕ Реестр.ДополнительнаяЗапись
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтКОбработке КАК ВтКОбработке
	|		ПО Расчеты.Регистратор = ВтКОбработке.Регистратор
	|			И ВтКОбработке.Регистратор ЕСТЬ NULL
	|ГДЕ
	|	Расчеты.Сторно
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// ИсправлениеПорядковОперацииОтгрузка
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор,
	|	Реестр.НомерДокументаИБ КАК НомерДокумента
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
	|		ПО Расчеты.Регистратор = Реестр.Ссылка
	|			И НЕ Реестр.ДополнительнаяЗапись
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтКОбработке КАК ВтКОбработке
	|		ПО Расчеты.Регистратор = ВтКОбработке.Регистратор
	|			И ВтКОбработке.Регистратор ЕСТЬ NULL
	|ГДЕ
	|	Расчеты.ОперацияВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.Отгрузка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// ИсправлениеПорядковОперацииПереносЗадолженностиПоЦД
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор,
	|	Реестр.НомерДокументаИБ КАК НомерДокумента
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
	|		ПО Расчеты.Регистратор = Реестр.Ссылка
	|			И НЕ Реестр.ДополнительнаяЗапись
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтКОбработке КАК ВтКОбработке
	|		ПО Расчеты.Регистратор = ВтКОбработке.Регистратор
	|			И ВтКОбработке.Регистратор ЕСТЬ NULL
	|ГДЕ
	|	Расчеты.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереносЗадолженностиМеждуФилиалами)
	|	И НЕ ТИПЗНАЧЕНИЯ(Расчеты.Регистратор) В (ТИП(Документ.ВозвратТоваровОтКлиента),
	|	                                         ТИП(Документ.ЗаявкаНаВозвратТоваровОтКлиента),
	|	                                         ТИП(Документ.ВозвратТоваровМеждуОрганизациями),
	|	                                         ТИП(Документ.ВыкупПринятыхНаХранениеТоваров))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтКПолучениюНомеров.Регистратор КАК Регистратор,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВтКПолучениюНомеров.НомерДокумента, """") КАК СТРОКА) КАК НомерДокумента
	|ПОМЕСТИТЬ ВтНомераЗаполненныеПоРеестру
	|ИЗ
	|	ВтКПолучениюНомеров КАК ВтКПолучениюНомеров
	|ГДЕ
	|	ДЛИНАСТРОКИ(ВЫРАЗИТЬ(ЕСТЬNULL(ВтКПолучениюНомеров.НомерДокумента, """") КАК СТРОКА)) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтКПолучениюНомеров.Регистратор КАК Регистратор
	|ИЗ
	|	ВтКПолучениюНомеров КАК ВтКПолучениюНомеров
	|ГДЕ
	|	ДЛИНАСТРОКИ(ВЫРАЗИТЬ(ЕСТЬNULL(ВтКПолучениюНомеров.НомерДокумента, """") КАК СТРОКА) ) = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтКПолучениюНомеров
	|";
	#КонецОбласти
	
	Запрос.УстановитьПараметр("ОперацииСРучнымКурсом", ОперативныеВзаиморасчетыСервер.ХозяйственныеОперацииСРучнымКурсом());
	
	РегистраторыСПустымиНомерами = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор");
	РегистраторыСНомерами = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(
		РегистраторыСПустымиНомерами,
		Метаданные.Документы.АктВыполненныхРабот.СтандартныеРеквизиты.Номер.Имя); 
	ТзРегистраторыСНомерами = Новый ТаблицаЗначений;
	ТзРегистраторыСНомерами.Колонки.Добавить("Регистратор",
		Новый ОписаниеТипов(Метаданные.РегистрыНакопления.РасчетыСКлиентами.СтандартныеРеквизиты.Регистратор.Тип.Типы()));
	ТзРегистраторыСНомерами.Колонки.Добавить("НомерДокумента", Новый ОписаниеТипов("Строка"));
	Для Каждого КлючИЗначение Из РегистраторыСНомерами Цикл
		Если Не ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ТзРегистраторыСНомерами.Добавить();
		НоваяСтрока.Регистратор = КлючИЗначение.Ключ;
		НоваяСтрока.НомерДокумента = КлючИЗначение.Значение;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТзРегистраторыСНомерами", ТзРегистраторыСНомерами);
	#Область ТекстЗапроса
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Таблица.Регистратор КАК Регистратор,
	|	ВЫРАЗИТЬ(Таблица.НомерДокумента КАК СТРОКА) КАК НомерДокумента
	|ПОМЕСТИТЬ ВтНомераЗаполненныеВнеЗапроса
	|ИЗ
	|	&ТзРегистраторыСНомерами КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.Регистратор КАК Регистратор,
	|	Таблица.НомерДокумента КАК НомерДокумента
	|ПОМЕСТИТЬ ВтНомера
	|ИЗ
	|	ВтНомераЗаполненныеВнеЗапроса КАК Таблица
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Таблица.Регистратор КАК Регистратор,
	|	Таблица.НомерДокумента КАК НомерДокумента
	|ИЗ
	|	ВтНомераЗаполненныеПоРеестру КАК Таблица
	|
	|ИНДЕКСИРОВАТЬ ПО 
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Документы к обработке, найденные до получения номеров
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВтКОбработке.Регистратор КАК Регистратор
	|ИЗ
	|	ВтКОбработке КАК ВтКОбработке
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// Сторно с заполненным порядком операции внутри документа
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНомера КАК ВтНомера
	|		ПО Расчеты.Регистратор = ВтНомера.Регистратор
	|ГДЕ
	|	Расчеты.Сторно
	|	И СТРНАЙТИ(Расчеты.ПорядокОперации, ВтНомера.НомерДокумента) > 0
	|	И ПОДСТРОКА(Расчеты.ПорядокОперации, СТРНАЙТИ(Расчеты.ПорядокОперации, ВтНомера.НомерДокумента) + ДЛИНАСТРОКИ(ВтНомера.НомерДокумента), 1) <> """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// Документы с лишними символами в порядке операции внутри документа
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНомера КАК ВтНомера
	|		ПО Расчеты.Регистратор = ВтНомера.Регистратор
	|ГДЕ
	|	СТРНАЙТИ(Расчеты.ПорядокОперации, ВтНомера.НомерДокумента) > 0
	|	И ДЛИНАСТРОКИ(ПОДСТРОКА(Расчеты.ПорядокОперации, СТРНАЙТИ(Расчеты.ПорядокОперации, ВтНомера.НомерДокумента) + ДЛИНАСТРОКИ(ВтНомера.НомерДокумента), 2)) > 1
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// Источники без порядка операции внутри документа
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНомера КАК ВтНомера
	|		ПО Расчеты.Регистратор = ВтНомера.Регистратор
	|ГДЕ
	|	Расчеты.АналитикаУчетаПоПартнерамПриемник <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка)
	|	И НЕ Расчеты.Сторно
	|	И СТРНАЙТИ(Расчеты.ПорядокОперации, ВтНомера.НомерДокумента) > 0
	|	И ДЛИНАСТРОКИ(ПОДСТРОКА(Расчеты.ПорядокОперации, СТРНАЙТИ(Расчеты.ПорядокОперации, ВтНомера.НомерДокумента) + ДЛИНАСТРОКИ(ВтНомера.НомерДокумента), 2)) = 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// Приемники без порядка операции внутри документа
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНомера КАК ВтНомера
	|		ПО Расчеты.Регистратор = ВтНомера.Регистратор
	|ГДЕ
	|	Расчеты.КорАналитикаУчетаПоПартнерам <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка)
	|	И НЕ Расчеты.Сторно
	|	И СТРНАЙТИ(Расчеты.ПорядокОперации, ВтНомера.НомерДокумента) > 0
	|	И ДЛИНАСТРОКИ(ПОДСТРОКА(Расчеты.ПорядокОперации, СТРНАЙТИ(Расчеты.ПорядокОперации, ВтНомера.НомерДокумента) + ДЛИНАСТРОКИ(ВтНомера.НомерДокумента), 2)) = 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// Отгрузка с порядком операции внутри документа 1
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНомера КАК ВтНомера
	|		ПО Расчеты.Регистратор = ВтНомера.Регистратор
	|ГДЕ
	|	Расчеты.ОперацияВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.Отгрузка)
	|	И НЕ Расчеты.Сторно
	|	И СТРНАЙТИ(Расчеты.ПорядокОперации, ВтНомера.НомерДокумента) > 0
	|	И ПОДСТРОКА(Расчеты.ПорядокОперации, СТРНАЙТИ(Расчеты.ПорядокОперации, ВтНомера.НомерДокумента) + ДЛИНАСТРОКИ(ВтНомера.НомерДокумента), 1) <> ""4""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// ПереносЗадолженностиМеждуФилиалами с порядком операции внутри документа 2
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНомера КАК ВтНомера
	|		ПО Расчеты.Регистратор = ВтНомера.Регистратор
	|ГДЕ
	|	Расчеты.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереносЗадолженностиМеждуФилиалами)
	|	И НЕ Расчеты.Сторно
	|	И НЕ ТИПЗНАЧЕНИЯ(Расчеты.Регистратор) В (ТИП(Документ.ВозвратТоваровОтКлиента),
	|	                                         ТИП(Документ.ЗаявкаНаВозвратТоваровОтКлиента),
	|	                                         ТИП(Документ.ВозвратТоваровМеждуОрганизациями),
	|	                                         ТИП(Документ.ВыкупПринятыхНаХранениеТоваров))
	|	И СТРНАЙТИ(Расчеты.ПорядокОперации, ВтНомера.НомерДокумента) > 0
	|	И ПОДСТРОКА(Расчеты.ПорядокОперации, СТРНАЙТИ(Расчеты.ПорядокОперации, ВтНомера.НомерДокумента) + ДЛИНАСТРОКИ(ВтНомера.НомерДокумента), 1) <> ""5""
	|";
	#КонецОбласти
	
	Регистраторы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор");
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(
		Параметры, 
		Регистраторы,
		ПолноеИмяРегистра);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяОбъекта = "РегистрНакопления.РасчетыСКлиентами";

	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	Если ОбновляемыеДанные.Количество() = 0 Тогда
		Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбновляемыеДанные", ОбновляемыеДанные);
	Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОбновляемыеДанные.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВтДляОбработки
		|ИЗ
		|	&ОбновляемыеДанные КАК ОбновляемыеДанные
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СсылкиДляОбработки.Регистратор КАК Регистратор,
		|	РеестрДокументов.СторнируемыйДокумент КАК СторнируемыйДокумент
		|ПОМЕСТИТЬ ВтСторнируемыеДокументы
		|ИЗ
		|	ВтДляОбработки КАК СсылкиДляОбработки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
		|			ПО СсылкиДляОбработки.Регистратор = РеестрДокументов.Ссылка
		|				И РеестрДокументов.СторноИсправление
		|				И НЕ РеестрДокументов.ДополнительнаяЗапись
		|ИНДЕКСИРОВАТЬ ПО
		|	СторнируемыйДокумент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СторнируемыеДокументы.Регистратор КАК Регистратор,
		|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	РасчетыСКлиентами.ОбъектРасчетов КАК ОбъектРасчетов,
		|	РасчетыСКлиентами.Валюта КАК Валюта,
		|	РасчетыСКлиентами.ВидДвижения КАК ВидДвижения,
		|	РасчетыСКлиентами.Сумма КАК Сумма,
		|	РасчетыСКлиентами.КОплате КАК КОплате,
		|	РасчетыСКлиентами.КОтгрузке КАК КОтгрузке,
		|	ПОДСТРОКА(РасчетыСКлиентами.ПорядокОперации, 9, 1) КАК ВидОперацииДляСортировки
		|ИЗ
		|	ВтСторнируемыеДокументы КАК СторнируемыеДокументы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
		|			ПО СторнируемыеДокументы.СторнируемыйДокумент = РасчетыСКлиентами.Регистратор
		|ГДЕ
		|	НЕ РасчетыСКлиентами.Сторно
		|	И (РасчетыСКлиентами.Сумма <> 0
		|		ИЛИ РасчетыСКлиентами.КОплате <> 0
		|		ИЛИ РасчетыСКлиентами.КОтгрузке <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СсылкиДляОбработки.Регистратор КАК Регистратор,
		|	РеестрДокументов.НомерДокументаИБ КАК НомерДокумента
		|ИЗ
		|	ВтДляОбработки КАК СсылкиДляОбработки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
		|			ПО СсылкиДляОбработки.Регистратор = РеестрДокументов.Ссылка
		|				И НЕ РеестрДокументов.ДополнительнаяЗапись
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	Организации.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|			ПО КлючиАналитикиУчетаПоПартнерам.Организация = Организации.Ссылка
		|		ПО РасчетыСКлиентами.АналитикаУчетаПоПартнерам = КлючиАналитикиУчетаПоПартнерам.Ссылка
		|ГДЕ
		|	РасчетыСКлиентами.Регистратор В(ВЫБРАТЬ Т.Регистратор ИЗ ВтДляОбработки КАК Т)
		|";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеСторнируемыхДокументов = РезультатЗапроса[2].Выгрузить();
	ДанныеСторнируемыхДокументов.Индексы.Добавить("Регистратор");
	ДанныеСторнируемыхДокументов.Индексы.Добавить("Регистратор, АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта, ВидДвижения, Сумма, КОплате, КОтгрузке");
	
	НомераДокументов = РезультатЗапроса[3].Выгрузить();
	НомераДокументов.Индексы.Добавить("Регистратор");
	
	ВалютыРегл = РезультатЗапроса[4].Выгрузить();
	ВалютыРегл.Индексы.Добавить("АналитикаУчетаПоПартнерам");
	ВалютаУпр = ОбщегоНазначенияУТПовтИсп.ЗначениеКонстанты("ВалютаУправленческогоУчета");
	РазрядностьЦелойЧастиКурса = Метаданные.ОпределяемыеТипы.КурсВалюты.Тип.КвалификаторыЧисла.Разрядность
	                           - Метаданные.ОпределяемыеТипы.КурсВалюты.Тип.КвалификаторыЧисла.РазрядностьДробнойЧасти;
	ОграничениеЦелойЧасти = Pow(10, РазрядностьЦелойЧастиКурса - 1);
	
	Для Каждого СтрокаОбновляемыхДанных Из ОбновляемыеДанные Цикл
		
		ОбновляемыйРегистратор = СтрокаОбновляемыхДанных.Регистратор;
		
		НачатьТранзакцию();
		
		Попытка
			
			ПричинаИсключения = "Блокировка";
			#Область Блокировки
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСКлиентами.НаборЗаписей");
			ЭлементБлокировки.УстановитьЗначение("Регистратор", ОбновляемыйРегистратор);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			Блокировка.Заблокировать();
			#КонецОбласти
			
			ПричинаИсключения = "ПлохиеДанные";
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ОбновляемыйРегистратор);
			НаборЗаписей.Прочитать();
			
			#Область ОчисткаПриемниковИсточниковУСторно
			Для Каждого Запись Из НаборЗаписей Цикл
				Если Запись.Сторно 
					И (Запись.ПоДаннымОбъектаРасчетовИсточника
						Или ЗначениеЗаполнено(Запись.КорАналитикаУчетаПоПартнерам)
						Или ЗначениеЗаполнено(Запись.КорОбъектРасчетов)
						Или ЗначениеЗаполнено(Запись.АналитикаУчетаПоПартнерамПриемник)
						Или ЗначениеЗаполнено(Запись.ОбъектРасчетовПриемник)
						Или ЗначениеЗаполнено(Запись.ВалютаПриемник)
						Или Запись.СуммаПриемник <> 0) Тогда
						Запись.ПоДаннымОбъектаРасчетовИсточника  = Ложь;
						Запись.КорАналитикаУчетаПоПартнерам      = Справочники.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка();
						Запись.КорОбъектРасчетов                 = Справочники.ОбъектыРасчетов.ПустаяСсылка();
						Запись.АналитикаУчетаПоПартнерамПриемник = Справочники.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка();
						Запись.ОбъектРасчетовПриемник            = Справочники.ОбъектыРасчетов.ПустаяСсылка();
						Запись.ВалютаПриемник                    = Справочники.Валюты.ПустаяСсылка();
						Запись.СуммаПриемник                     = 0;
				КонецЕсли;
			КонецЦикла;
			#КонецОбласти
			
			#Область ИсправлениеПорядковОперацииВнутриДокумента
			СтрокиНомерДокумента = НомераДокументов.НайтиСтроки(Новый Структура("Регистратор", ОбновляемыйРегистратор));
			Если СтрокиНомерДокумента.Количество() > 0
				И ЗначениеЗаполнено(СтрокиНомерДокумента[0].НомерДокумента) Тогда
				НомерДокумента = СтрокиНомерДокумента[0].НомерДокумента;
			Иначе
				НомерДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбновляемыйРегистратор,
					Метаданные.Документы.АктВыполненныхРабот.СтандартныеРеквизиты.Номер.Имя);
			КонецЕсли;
			ИсправитьПорядокОперацииВПределахДокумента(НаборЗаписей, НомерДокумента);
			#КонецОбласти
			
			#Область ИсправлениеПорядковОперацииПлатежейБезДатыПогашения
			Для Каждого Запись Из НаборЗаписей Цикл
				Если Запись.ВидДвижения = ВидДвиженияНакопления.Расход
					И Запись.Сумма > 0 
					И Запись.ДатаПлатежа = Дата(1,1,1)
					И Лев(Запись.ПорядокЗачетаПоДатеПлатежа,4) <> "3000" Тогда
					
					Запись.ПорядокЗачетаПоДатеПлатежа = "30000101" + Прав(Запись.ПорядокЗачетаПоДатеПлатежа,СтрДлина(Запись.ПорядокЗачетаПоДатеПлатежа)-8);
					
				КонецЕсли;
			КонецЦикла;
			#КонецОбласти
			
			#Область ИсправлениеПорядковОперацииВводаОстатковАвансов
			Для Каждого Запись Из НаборЗаписей Цикл
				Если (ТипЗнч(ОбновляемыйРегистратор) = Тип("ДокументСсылка.ВводОстатковВзаиморасчетов")
						Или ТипЗнч(ОбновляемыйРегистратор) = Тип("ДокументСсылка.ВводОстатков"))
					И Запись.ДатаРегистратора <> Запись.Период
					И Запись.ВидДвижения = ВидДвиженияНакопления.Расход
					И Запись.ДатаРегистратора >= Дата(2010, 1, 1)
					И Лев(Запись.ПорядокОперации, 8) <> Формат(Запись.Период, "ДФ=yyyyMMdd") Тогда
					
					ДатаСтрокой = Формат(Запись.Период, "ДФ=yyyyMMdd");
					Запись.ПорядокОперации = ДатаСтрокой + Сред(Запись.ПорядокОперации, 9);
					
				КонецЕсли;
			КонецЦикла;
			#КонецОбласти
			
			#Область ИсправлениеДатыРегистратораАктовПремииКлиенту
			Для Каждого Запись Из НаборЗаписей Цикл
				Если ТипЗнч(ОбновляемыйРегистратор) = Тип("ДокументСсылка.АктПремииКлиенту")
					И Запись.ДатаРегистратора <> Запись.Период Тогда
					
					Запись.ДатаРегистратора = Запись.Период;
					
				КонецЕсли;
			КонецЦикла;
			#КонецОбласти
			
			#Область ИсправлениеПорядковОперацииСторно
			ДвиженияСторнируемогоДокумента = ДанныеСторнируемыхДокументов.НайтиСтроки(Новый Структура("Регистратор", ОбновляемыйРегистратор));
			Для Каждого Запись Из НаборЗаписей Цикл
				Если Запись.Сторно
					И (Сред(Запись.ПорядокОперации, 9, 1) = "1"
						Или Сред(Запись.ПорядокОперации, 9, 1) = "9") Тогда
					
					// Проверим количество разных видов операций в движениях исправляемого документа
					ЕстьРазныеВидыОпераций = Ложь;
					ВидОперацииДляСортировки = "";
					Для Каждого СтрокаДвижений Из ДвиженияСторнируемогоДокумента Цикл
						Если ЗначениеЗаполнено(СтрокаДвижений.ВидОперацииДляСортировки) Тогда
							Если Не ЗначениеЗаполнено(ВидОперацииДляСортировки) Тогда
								ВидОперацииДляСортировки = СтрокаДвижений.ВидОперацииДляСортировки;
							ИначеЕсли СтрокаДвижений.ВидОперацииДляСортировки <> ВидОперацииДляСортировки Тогда
								ЕстьРазныеВидыОпераций = Истина;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					
					// Если есть несколько разных видов операций, то нужно заполнить вид операции для сортировки
					// по ключевым полям и ресурсам исправляемого документа, иначе - берем единственный вид опереции.
					Если ЕстьРазныеВидыОпераций Тогда
						
						СтруктураОтбора = Новый Структура;
						СтруктураОтбора.Вставить("Регистратор",               ОбновляемыйРегистратор);
						СтруктураОтбора.Вставить("АналитикаУчетаПоПартнерам", Запись.АналитикаУчетаПоПартнерам);
						СтруктураОтбора.Вставить("ОбъектРасчетов",            Запись.ОбъектРасчетов);
						СтруктураОтбора.Вставить("Валюта",                    Запись.Валюта);
						СтруктураОтбора.Вставить("ВидДвижения",               Запись.ВидДвижения);
						СтруктураОтбора.Вставить("Сумма",                   - Запись.Сумма);
						СтруктураОтбора.Вставить("КОплате",                 - Запись.КОплате);
						СтруктураОтбора.Вставить("КОтгрузке",               - Запись.КОтгрузке);
						
						ВидыОперацийПоКлючевымПолям = ДанныеСторнируемыхДокументов.НайтиСтроки(СтруктураОтбора);
						
						ВидОперацииДляСортировки = "";
						Для Каждого СтрокаДвижений Из ВидыОперацийПоКлючевымПолям Цикл
							Если ЗначениеЗаполнено(СтрокаДвижений.ВидОперацииДляСортировки) Тогда
								ВидОперацииДляСортировки = СтрокаДвижений.ВидОперацииДляСортировки;
								Прервать;
							КонецЕсли;
						КонецЦикла;
						
						Запись.ПорядокОперации = Лев(Запись.ПорядокОперации, 8) 
							+ ?(ЗначениеЗаполнено(ВидОперацииДляСортировки), ВидОперацииДляСортировки, "2")
							+ Сред(Запись.ПорядокОперации, 10);
						
					Иначе
						
						Запись.ПорядокОперации = Лев(Запись.ПорядокОперации, 8) 
							+ ?(ЗначениеЗаполнено(ВидОперацииДляСортировки), ВидОперацииДляСортировки, "2")
							+ Сред(Запись.ПорядокОперации, 10);
						
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
			#КонецОбласти
			
			#Область ЗаполнениеКурсов
			Для Каждого Запись Из НаборЗаписей Цикл
				Если Запись.Сумма <> 0
					И Запись.СуммаРегл <> 0
					И Запись.КурсЧислительВалютыВзаиморасчетов = 0
					И Запись.КурсЗнаменательВалютыВзаиморасчетов = 0 Тогда
					СтрокаВалютыРегл = ВалютыРегл.Найти(Запись.АналитикаУчетаПоПартнерам, "АналитикаУчетаПоПартнерам");
					Если СтрокаВалютыРегл <> Неопределено 
						И Запись.Валюта <> СтрокаВалютыРегл.ВалютаРегламентированногоУчета
						И (Запись.ВалютаДокумента <> СтрокаВалютыРегл.ВалютаРегламентированногоУчета
							Или ТипЗнч(ОбновляемыйРегистратор) = Тип("ДокументСсылка.ВводОстатков")
							Или ТипЗнч(ОбновляемыйРегистратор) = Тип("ДокументСсылка.ВводОстатковВзаиморасчетов")) Тогда
						КурсВалютыВзаиморасчетов = Запись.СуммаРегл / Запись.Сумма;
						ЧислительПриведенный = КурсВалютыВзаиморасчетов;
						ЗнаменательПриведенный = 1;
						Пока ЧислительПриведенный < ОграничениеЦелойЧасти
							И ЗнаменательПриведенный < ОграничениеЦелойЧасти Цикл
							ЧислительПриведенный = ЧислительПриведенный * 10;
							ЗнаменательПриведенный = ЗнаменательПриведенный * 10;
						КонецЦикла;
						Запись.КурсЧислительВалютыВзаиморасчетов = ЧислительПриведенный;
						Запись.КурсЗнаменательВалютыВзаиморасчетов = ЗнаменательПриведенный;
					КонецЕсли;
				КонецЕсли;
				Если Запись.СуммаРегл <> 0
					И Запись.СуммаУпр <> 0
					И Запись.КурсЧислительВалютыУпр = 0
					И Запись.КурсЗнаменательВалютыУпр = 0
					И Запись.Валюта <> ВалютаУпр
					И (Запись.ВалютаДокумента <> ВалютаУпр
						Или ТипЗнч(ОбновляемыйРегистратор) = Тип("ДокументСсылка.ВводОстатков")
						Или ТипЗнч(ОбновляемыйРегистратор) = Тип("ДокументСсылка.ВводОстатковВзаиморасчетов")) Тогда
					КурсВалютыУпр = Запись.СуммаРегл / Запись.СуммаУпр;
					ЧислительПриведенный = КурсВалютыУпр;
					ЗнаменательПриведенный = 1;
					Пока ЧислительПриведенный < ОграничениеЦелойЧасти
						И ЗнаменательПриведенный < ОграничениеЦелойЧасти Цикл
						ЧислительПриведенный = ЧислительПриведенный * 10;
						ЗнаменательПриведенный = ЗнаменательПриведенный * 10;
					КонецЦикла;
					Запись.КурсЧислительВалютыУпр = ЧислительПриведенный;
					Запись.КурсЗнаменательВалютыУпр = ЗнаменательПриведенный;
				КонецЕсли;
			КонецЦикла;
			#КонецОбласти
			
			ИзменилисьИтоги = Ложь;
			Если НаборЗаписей.Количество() > 0 Тогда
				ИзменилисьИтоги = ЕстьИзмененияИтоговНабора(НаборЗаписей);
			КонецЕсли;
			
			Если НаборЗаписей.Модифицированность() И НЕ ИзменилисьИтоги Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(НаборЗаписей);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			Если ПричинаИсключения = "ПлохиеДанные" Тогда
				ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), ОбновляемыйРегистратор);
				Если ЗначениеЗаполнено(ОбновляемыйРегистратор) Тогда
					ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(НаборЗаписей);
					ОбновлениеИнформационнойБазы.ЗарегистрироватьПроблемуСДанными(
						ОбновляемыйРегистратор,
						ТекстСообщенияОбОшибке(ИнформацияОбОшибке(), ОбновляемыйРегистратор)
						+ Символы.ПС + ТекстПерепроведитеДокументВРучную());
				КонецЕсли;
			КонецЕсли;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
